{
  "Items": [
    {
      "name": "Container",
      "description": "Удобный виджет, сочетающий в себе стандартные виджеты рисования, позиционирования и изменения размера.\n\tКонтейнер сначала окружает дочерний элемент заполнением (раздувается любыми границами, присутствующими в оформлении), а затем применяет дополнительные ограничения к заполненному экстенту (включая ширину и высоту в качестве ограничений, если любой из них не равен нулю). Затем контейнер окружается дополнительным пустым пространством, описанным на полях.",
      "price": 10,
      "img": "images/Container.png"
    },
    {
      "name": "ListView",
      "description": "Прокручиваемый список виджетов, расположенных линейно. \n\tListView - наиболее часто используемый виджет с прокруткой. Он отображает своих дочерних элементов один за другим в направлении прокрутки. На поперечной оси дочерние элементы должны заполнять ListView.\nЕсли не равно нулю, itemExtent заставляет дочерние элементы иметь заданный экстент в направлении прокрутки. Указание itemExtent более эффективно, чем предоставление дочерним элементам возможности определять свой собственный экстент, потому что механизм прокрутки может использовать предварительное знание дочернего экстента для экономии работы, например, когда положение прокрутки резко меняется.",
      "price": 20,
      "img": "images/ListView.png"
    },
    {
      "name": "ListTile",
      "description": "Одна строка с фиксированной высотой, которая содержит текст, подзаголовок , а также начальный или конечный значок. \n\tListTile содержит от одной до трех строк текста, возможно, окруженных значками или другими виджетами, такими как флажки. Значки (или другие виджеты) для плитки определяются с помощью начальных и конечных параметров. Первая строка текста не является обязательной и указывается вместе с заголовком. Значение subtitle, которое является необязательным, будет занимать пространство, выделенное для дополнительной строки текста или двух строк, если isThreeLine истинно. Если параметр «плотность» равен true, то общая высота этой плитки и размер стилей DefaultTextStyles, охватывающих виджет заголовка и субтитров, уменьшаются.",
      "price": 30,
      "img": "images/ListTile.png"
    },
    {
      "name": "Flexible",
      "description": "Виджет, управляющий тем, как изгибается дочерний элемент Row, Column или Flex. Использование Flexible виджета дает дочернему элементу Row, Column или Flex элемента гибкость для расширения, чтобы заполнить доступное пространство на главной оси (например, по горизонтали для строки или по вертикали для столбца), но, в отличие от Expanded, Flexible не требует, чтобы ребенок заполнил доступное пространство.",
      "price": 42,
      "img": "images/Flexible.png"
    },
    {
      "name": "Expanded",
      "description": "Виджет, расширяющий дочерний элемент Row, Column или Flex, чтобы дочерний элемент заполнил доступное пространство. При использовании расширенного виджета дочерний элемент Row, Column или Flex расширяется, чтобы заполнить доступное пространство вдоль главной оси (например, по горизонтали для строки или по вертикали для столбца)",
      "price": 548,
      "img": "images/Expanded.png"
    },
    {
      "name": "SafeArea",
      "description": "Виджет вставляет дочерний элемент таким образом, чтобы он не перекрывался Системной информацией (часы, уровень заряда и т.д.)",
      "price": 154,
      "img": "images/SafeArea.png"
    },
    {
      "name": "Spacer",
      "description": "Spacer создает регулируемый пустой разделитель, который можно использовать для настройки расстояния между виджетами в контейнере Flex, например в Row или Column.",
      "price": 1024,
      "img": "images/Spacer.png"
    },
    {
      "name": "Opacity",
      "description": "Данный виджет делает свой дочерний элемент полупрозрачным",
      "price": 64,
      "img": "images/Opacity.png"
    },
    {
      "name": "Draggable",
      "description": "Виджет, который можно перетащить на DragTarget. Когда перетаскиваемый виджет распознает начало жеста перетаскивания, он отображает виджет обратной связи, который отслеживает палец пользователя по экрану. Если пользователь поднимает палец, находясь над DragTarget, этой цели предоставляется возможность принять данные, переносимые перетаскиваемым объектом.",
      "price": 512,
      "img": "images/Draggable.png"
    },
    {
      "name": "SizedBox",
      "description": "Коробка заданного размера. Если указан дочерний элемент, этот виджет заставляет его дочерний элемент иметь определенную ширину и / или высоту (при условии, что значения разрешены родительским элементом этого виджета). Если ширина или высота равна нулю, этот виджет попытается изменить свой размер, чтобы он соответствовал размеру дочернего элемента в этом измерении. Если размер дочернего элемента зависит от размера его родительского элемента, необходимо указать высоту и ширину.",
      "price": 333,
      "img": "images/SizedBox.png"
    },
    {
      "name": "Stack",
      "description": "Виджет размещает свои дочерне элементы относительно краев своего блока",
      "price": 12,
      "img": "images/Stack.png"
    },
    {
      "name": "Table",
      "description": "Виджет, использующий алгоритм компоновки таблицы для своих дочерних элементов.",
      "price": 9,
      "img": "images/Table.png"
    },
    {
      "name": "Wrap",
      "description": "Виджет отображает дочерние элементы в несколько горизонтальных или вертикальных прогонов.",
      "price": 10000,
      "img": "images/Wrap.png"
    }
  ]
}

